const main = document.querySelector(".main");

const array = [
    {
        key: 1111,
        value: "Принести 20 пар шкарпеток"
    },
    {
        key: 1112,
        value: "Одягнути наставника 20 кофт"
    },
    {
        key: 1113,
        value: "Заспівати улюблену пісню інструктора"
    },
    {
        key: 1114,
        value: "Показати пародію на кіно"
    },
    {
        key: 1115,
        value: "Принести щось солодке"
    },
    {
        key: 1116,
        value: "Вгадати вік інструктора"
    },
    {
        key: 1117,
        value: "Кожен у групі має назвати скоромовку"
    },
    {
        key: 1118,
        value: "Зняти і показати смішний ТІК ТОК"
    },
    {
        key: 1119,
        value: "Побудувати максимальну високу вежу з людей в групі"
    },
    {
        key: 1120,
        value: "Кидати кросівки на максимальну відстань"
    },
    {
        key: 1121,
        value: "Зробити фотку яку покаже інструктор"
    },
    {
        key: 1122,
        value: "Зробити косплей на людей в чорному"
    },
    {
        key: 1123,
        value: "Зняти гайд на «Успішний успіх»"
    },
    {
        key: 1124,
        value: "Зробити фотку де всі сидять в середині кросівка"
    },
    {
        key: 1125,
        value: "Зробити відео як хтось себе змиває в туалеті"
    },
    {
        key: 1126,
        value: "Принести дитячий підгузник"
    },
    {
        key: 1127,
        value: "Намалювати тату рукава наставнику"
    },
    {
        key: 1128,
        value: "Вгадати улюблений фільм інструктора"
    },
    {
        key: 1129,
        value: "Показати пʼєсу Ромеє і Джульєтта"
    },
    {
        key: 1130,
        value: "Принести 10 автографів людей з робочки"
    },
    {
        key: 1131,
        value: "Записати на диктофон власний трек"
    },
    {
        key: 1132,
        value: "Принести щось солоне"
    },
    {
        key: 1133,
        value: "Принести букет квітів інструктору"
    },
    {
        key: 1134,
        value: "Побудувати піраміду з людей (можна задіяти інші групки) 5 - 4 - 3 - 2 -1"
    },
    {
        key: 1135,
        value: "Закопати людину у пісок багнюку"
    },
    {
        key: 1136,
        value: "Зробити вогнище підручними засобами"
    },
    {
        key: 1137,
        value: "Фотку із чорною людиною"
    },
    {
        key: 1138,
        value: "Помити голову інструктору"
    },
    {
        key: 1139,
        value: "Принести копійок на 50 грн"
    },
    {
        key: 1140,
        value: "Побудувати грязьовика"
    },
    {
        key: 1141,
        value: "Викликати Нікіту на танцювальний батл"
    },
    {
        key: 1142,
        value: "Зробити фотку з дитиною"
    },
    {
        key: 1143,
        value: "Підкинути наставника 10 разів у повітря"
    },
    {
        key: 1144,
        value: "Помити туалет на відко"
    },
    {
        key: 1145,
        value: "Заспівати гімн України на весь табір"
    },
    {
        key: 1146,
        value: "Купити морозиво іншому наставнику"
    },
    {
        key: 1147,
        value: "Намалювати вуса і монобров всій групі"
    },
    {
        key: 1148,
        value: "Показати пародію на Дмитра Гордона"
    },
    {
        key: 1140,
        value: ""
    },
];

window.addEventListener("load", (e) => {
    
    const urlParams = new URLSearchParams(window.location.search);
    const key = urlParams.get('key');
    if (key == null){
      location.replace(location.href + "?key=3245")
    }
    const value = array.find((elem)=> elem.key == key).value;
    
    main.innerHTML = value;
})