const array = ['3809', '6647', '0705'];
const answer = [
    'Хоча я і робив цю пропозицію в жарт, у кожного жарта є своя доля жарта))<br/>' +
    'Я навіть не міг уявити наскільки дорогою людиною ти для мене станеш))Бажаю щоб усі твої мрії збувалися, щоб Бог благословляв тебе, і вів до найкращого життя))<br/>' +
    'Наступний код буде там де ми разом зустріли світанок))<br/>' +
    'Знаю йти дуже далеко))',

    'Саме тут я зрозумів яка ти насправді, саме тут Бог показав мені справжню тебе, усі ті розмови про наше минуле, про те наскільки ми схожі, показали саму тебе))<br/>' +
    'Саме тут я зрозумів що Бог послав мені неймовірну людину завдяки якої я буду ставати тільки краще, яка буде мотивувати мене навіть не підозрюючи це))<br/>' +
    'Ти все зможеш бо ти дуже мудра і дуже сильна))<br/>' +
    'Ми з тобою:)Ти найкраща, люблю тебе:)<br/>' + 
    'Наступний код буде там де ми «тайно» зустрічалися))', 

    'Це місце не дуже особливе для мене))<br/>' +
    'Я хочу сказати що ці місця не дуже важливі для мене, бо мені важлива саме ти))<br/>' +
    'Я хотів провести тебе по алеї памяті початку наших стосунків і я хочу сказати що ці місця для мене нічого без тебе))<br/>' +
    'Я хочу сказати що ти найкраща))<br/>' +
    'Ти добра, мила, мудра, стильна, красива, щиросердечна, ти просто найкраща))<br/>' +
    'Я дуже пишаюся тобою:)Ти будеш дуже хорошою дружиною і мамою))<br/>' +
    'Нехай Бог благословить усе твоє життя))<br/>' +
    'Останне місце сюрпиз у твоїй кімнаті на столі))'
];

document.getElementsByClassName("submit")[0].onclick = function () {
    
    var isChanged = false;
    for (let i = 0; i < array.length; i++) {
        if (document.getElementsByClassName("code")[0].value == array[i]) {
            document.getElementsByClassName('title')[0].innerHTML = answer[i];
            isChanged = true;
        }
    }   
    if (!isChanged) {
        h2.innerHTML = "Неверний Код";
    }
}

document.getElementsByClassName('title')[0].innerHTML = "Привіт, це невеликий 'квест'))<br/>Памятаєш місце де я вдягнув тобі кільце вперший раз?<br/>Так ось, там буде код який тобі треба ввести в сюди, далі буде наступна загадка))";